; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	image2 - mode
	image0 - mode
	infrared4 - mode
	thermograph1 - mode
	thermograph3 - mode
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph3)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument6 image0)
	(supports instrument6 thermograph3)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image0)
	(supports instrument8 infrared4)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 thermograph3)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star2)
	(supports instrument10 thermograph1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star4)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star5)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite5 Star2)
	(have_image Star5 image0)
	(have_image Phenomenon6 infrared4)
	(have_image Star7 thermograph1)
	(have_image Planet8 image0)
	(have_image Planet9 thermograph1)
))

)

; plan
1. (turn_to satellite3 groundstation3 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation3)
   goals met: 1 of 7
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 7
3. (calibrate satellite3 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 1 of 7
4. (turn_to satellite3 star5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star5)
   goals met: 1 of 7
5. (take_image satellite3 star5 instrument5 image0)
   added: (have_image star5 image0)
   goals met: 2 of 7
6. (turn_to satellite3 planet9 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet9)
   goals met: 2 of 7
7. (take_image satellite3 planet9 instrument5 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 3 of 7
8. (turn_to satellite3 planet8 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet8)
   goals met: 3 of 7
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 7
10. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 3 of 7
11. (take_image satellite3 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 4 of 7
12. (turn_to satellite1 phenomenon6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 7
13. (take_image satellite1 phenomenon6 instrument3 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 5 of 7
14. (turn_to satellite1 groundstation3 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation3)
   goals met: 6 of 7
15. (turn_to satellite3 star7 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star7)
   goals met: 6 of 7
16. (take_image satellite3 star7 instrument5 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 7 of 7
